# Movie_SQL

## Import

In [324]:
import pandas as pd
import numpy as np
from sqlalchemy.engine import create_engine
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from urllib.parse import quote_plus
import json 

with open('../secrets.json') as f:
    login = json.load(f)
# Variables for connectin and engine
username = login['username']
password = quote_plus(login['password']) # Using the quote function to make the password compatible
db_name = "Movie_Core"

In [325]:
# Create connection and engine
connection = f'mysql+pymysql://{username}:{password}@localhost/{db_name}'
engine = create_engine(connection)

In [326]:
# Check if the database exists. If not, create it.
if database_exists(connection) == False:
  create_database(connection)
else:
  print('The database already exists')

The database already exists

## Load Dataset

In [327]:
filename = ('Data/title_basics.csv.gz')
df_basics = pd.read_csv(filename)
df_basics.info()
df_basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89097 entries, 0 to 89096
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          89097 non-null  object
 1   titleType       89097 non-null  object
 2   primaryTitle    89097 non-null  object
 3   originalTitle   89097 non-null  object
 4   isAdult         89097 non-null  int64
 5   startYear       86561 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  89097 non-null  int64
 8   genres          89097 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 6.1+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [328]:
filename2 = ('Data/title_ratings.csv.gz')
df_ratings = pd.read_csv(filename2)
df_ratings.info()
df_ratings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 496733 entries, 0 to 496732
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         496733 non-null  object
 1   averageRating  496733 non-null  float64
 2   numVotes       496733 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.4+ MB

      tconst  averageRating  numVotes
0  tt0000001            5.7      1966
1  tt0000002            5.8       263
2  tt0000005            6.2      2607
3  tt0000006            5.2       181
4  tt0000007            5.4       816

In [329]:
filename3 = ('Data/tmdb_results_combined.csv.gz')
df_tmdb = pd.read_csv(filename3)
df_tmdb.info()
df_tmdb.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2563 entries, 0 to 2562
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2563 non-null   object
 1   adult                  2561 non-null   float64
 2   backdrop_path          1390 non-null   object
 3   belongs_to_collection  206 non-null    object
 4   budget                 2561 non-null   float64
 5   genres                 2561 non-null   object
 6   homepage               173 non-null    object
 7   id                     2561 non-null   float64
 8   original_language      2561 non-null   object
 9   original_title         2561 non-null   object
 10  overview               2510 non-null   object
 11  popularity             2561 non-null   float64
 12  poster_path            2304 non-null   object
 13  production_companies   2561 non-null   object
 14  production_countries   2561 non-null   object
 15  release_date           2543 non-null   object
 16  revenue                2561 non-null   float64
 17  runtime                2561 non-null   float64
 18  spoken_languages       2561 non-null   object
 19  status                 2561 non-null   object
 20  tagline                1098 non-null   object
 21  title                  2561 non-null   object
 22  video                  2561 non-null   float64
 23  vote_average           2561 non-null   float64
 24  vote_count             2561 non-null   float64
 25  certification          815 non-null    object
dtypes: float64(9), object(17)
memory usage: 520.7+ KB

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.115,2187.0,PG

## Create genres and genres_lookup tables

In [330]:
# create a column with a list of genres
df_basics['genres_split'] = df_basics['genres'].str.split(',')
df_basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama,[Drama]
...,...,...,...,...,...,...,...,...,...,...
89092,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019.0,NaN,74,Drama,[Drama]
89093,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019.0,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
89094,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,NaN,51,Drama,[Drama]
89095,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
89096,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History","[Drama, History]"

In [331]:
exploded_genres = df_basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
89095,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Action
89095,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Adventure
89095,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
89096,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",Drama
89096,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",History

In [332]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

**Title_genres**

In [333]:
# create a new table titles_genres
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [334]:
# Make the genre mapper dictionary 
genre_ints = range(len(unique_genres))
genre_id_map = dict(zip(unique_genres, genre_ints))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [335]:
# make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_id_map)
title_genres = title_genres.drop(columns ='genres_split')

**Genre_lookup**

In [336]:
# Manually make a dataframe with named cols from the .keyd and .values
genre_lookup = pd.DataFrame({'Genre_Name': genre_id_map.keys(),
                            'Genre_ID': genre_id_map.values()})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

**Title_basics**

In [337]:
title_basics = df_basics.drop(columns = ['originalTitle', 'isAdult', 'titleType', 
                           'genres','genres_split'])
title_basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70
2,tt0069049,The Other Side of the Wind,2018.0,NaN,122
3,tt0088751,The Naked Monster,2005.0,NaN,100
4,tt0096056,Crime and Punishment,2002.0,NaN,126

**Title_ratings**

In [338]:
title_ratings = df_ratings
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1966
1  tt0000002            5.8       263
2  tt0000005            6.2      2607
3  tt0000006            5.2       181
4  tt0000007            5.4       816

**Tmdb_data**

In [339]:
tmdb_data = df_tmdb
tmdb_data.info()
tmdb_data.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2563 entries, 0 to 2562
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2563 non-null   object
 1   adult                  2561 non-null   float64
 2   backdrop_path          1390 non-null   object
 3   belongs_to_collection  206 non-null    object
 4   budget                 2561 non-null   float64
 5   genres                 2561 non-null   object
 6   homepage               173 non-null    object
 7   id                     2561 non-null   float64
 8   original_language      2561 non-null   object
 9   original_title         2561 non-null   object
 10  overview               2510 non-null   object
 11  popularity             2561 non-null   float64
 12  poster_path            2304 non-null   object
 13  production_companies   2561 non-null   object
 14  production_countries   2561 non-null   object
 15  release_date           2543 non-null   object
 16  revenue                2561 non-null   float64
 17  runtime                2561 non-null   float64
 18  spoken_languages       2561 non-null   object
 19  status                 2561 non-null   object
 20  tagline                1098 non-null   object
 21  title                  2561 non-null   object
 22  video                  2561 non-null   float64
 23  vote_average           2561 non-null   float64
 24  vote_count             2561 non-null   float64
 25  certification          815 non-null    object
dtypes: float64(9), object(17)
memory usage: 520.7+ KB

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.115,2187.0,PG

In [340]:
tmdb2_data = tmdb_data.loc[:,['imdb_id', 'budget', 'revenue','certification']]
tmdb2_data.head()

     imdb_id      budget     revenue certification
0          0         NaN         NaN           NaN
1  tt0113026  10000000.0         0.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694    150000.0  12854953.0            PG

## Make Tables & Set Primary Key

**title_basics table**

In [341]:
title_basics.dtypes

tconst             object
primaryTitle       object
startYear         float64
endYear           float64
runtimeMinutes      int64
dtype: object

In [342]:
## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [343]:
title_basics.to_sql('title_basics', engine, dtype = df_schema, 
                    if_exists = 'replace', index = False)

89097

In [344]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [345]:
q = """
SELECT *
FROM title_basics
LIMIT 5
"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0088751,The Naked Monster,2005.0,None,100
4,tt0096056,Crime and Punishment,2002.0,None,126

**title_ratings table**

In [346]:
title_ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [347]:
## Calculate max string lengths for object columns
key_len2 = title_ratings['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema2 = {
    "tconst": String(key_len2+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [348]:
# Save to sql
title_ratings.to_sql('title_ratings', engine, dtype = df_schema2, 
                     if_exists = 'replace', index = False)

496733

In [349]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [350]:
q2 = """
SELECT *
FROM title_ratings
LIMIT 5
"""
pd.read_sql(q2, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1966
1  tt0000002            5.8       263
2  tt0000005            6.2      2607
3  tt0000006            5.2       181
4  tt0000007            5.4       816

**genre table**

In [351]:
genre_lookup.dtypes

Genre_Name    object
Genre_ID       int64
dtype: object

In [352]:
## Calculate max string lengths for object columns
title_len2 = genre_lookup['Genre_Name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema3 = {
    "Genre_Name": Text(title_len2+1),
    'Genre_ID':Integer()}

In [353]:
genre_lookup.to_sql('genre', engine, dtype = df_schema3, 
                    if_exists = 'replace', index = False)

26

In [354]:
engine.execute('ALTER TABLE genre ADD PRIMARY KEY (`Genre_ID`);')

In [355]:
q3 = """
SELECT *
FROM genre
LIMIT 5
"""
pd.read_sql(q3, engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

**title_genre Table**

In [356]:
title_genres.dtypes

tconst      object
genre_id     int64
dtype: object

In [357]:
## Calculate max string lengths for object columns
key_len3 = title_genres['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema4 = {
    "tconst": String(key_len3+1), 
    'genre_id':Integer()}

In [358]:
title_genres.to_sql('title_genres', engine, dtype = df_schema4, 
                   if_exists = 'replace', index = False)

165681

In [359]:
q4 = """
SELECT *
FROM title_genres
LIMIT 5
"""
pd.read_sql(q4, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [360]:
tmdb2_data.dtypes

imdb_id           object
budget           float64
revenue          float64
certification     object
dtype: object

In [361]:
tmdb2_data = tmdb2_data.loc[tmdb2_data['imdb_id']!='0']

In [362]:
## Calculate max string lengths for object columns
key_len4 = tmdb2_data['imdb_id'].fillna('').map(len).max()
title_len4 = tmdb2_data['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema4 = {
    "imdb_id": String(key_len4+1), 
    "certification": Text(title_len4+1),
    'budget':Float(),
    'revenue':Float()}

In [363]:
tmdb2_data.to_sql('tmdb_data', engine, dtype = df_schema4, 
                  if_exists = 'replace', index = False)

2561

In [365]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [367]:
q5 = """
SELECT *
FROM tmdb_data
LIMIT 5
"""
pd.read_sql(q5, engine)

     imdb_id      budget     revenue certification
0  tt0035423  48000000.0  76019000.0         PG-13
1  tt0113026  10000000.0         0.0          None
2  tt0113092         0.0         0.0          None
3  tt0114447         0.0         0.0          None
4  tt0116391         0.0         0.0          None

In [368]:
q6 = """ SHOW TABLES;"""
pd.read_sql(q6, engine)

  Tables_in_movie_core
0                genre
1         title_basics
2         title_genres
3        title_ratings
4            tmdb_data